Revit 2024 API
DirectShapeType.AddReferencePoint Method
Overload List
Name | Description
AddReferencePoint(XYZ)
 Adds a reference point to the DirectShapeType.
AddReferencePoint(XYZ, DirectShapeReferenceOptions)
 Adds a reference point to the DirectShapeType.
See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace